# Agenda

1. More on loading CSV files (especially a number of useful options / keyword arguments)
2. Reading Excel files
3. Reading from URLs
4. Scraping Web pages

In [1]:
import pandas as pd

filename = '../data/taxi.csv'  

df = pd.read_csv(filename)

df

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9994,1,2015-06-01 00:12:59,2015-06-01 00:24:18,1,2.70,-73.947792,40.814972,1,N,-73.973358,40.783638,2,11.0,0.5,0.5,0.00,0.0,0.3,12.30
9995,1,2015-06-01 00:12:59,2015-06-01 00:28:16,1,4.50,-74.004066,40.747818,1,N,-73.953758,40.779285,1,16.0,0.5,0.5,3.00,0.0,0.3,20.30
9996,2,2015-06-01 00:13:00,2015-06-01 00:37:25,1,5.59,-73.994377,40.766102,1,N,-73.903206,40.750546,2,21.0,0.5,0.5,0.00,0.0,0.3,22.30
9997,2,2015-06-01 00:13:02,2015-06-01 00:19:10,6,1.54,-73.978302,40.748531,1,N,-73.989166,40.762852,2,6.5,0.5,0.5,0.00,0.0,0.3,7.80
9998,1,2015-06-01 00:13:04,2015-06-01 00:36:33,1,5.80,-73.983215,40.726414,1,N,-73.924133,40.701645,1,21.0,0.5,0.5,4.45,0.0,0.3,26.75

In [2]:
# read_csv has a huge number of options!

# to explore them, I'm going to create a very small CSV file
# we can always export a data frame using df.to_csv

In [3]:
import numpy as np
from pandas import Series, DataFrame

np.random.seed(0)
df = DataFrame(np.random.randint(0, 1000, [4,5]))
df

     0    1    2    3    4
0  684  559  629  192  835
1  763  707  359    9  723
2  277  754  804  599   70
3  472  600  396  314  705

In [4]:
df.to_csv('mydata.csv', header=None)   # don't write the header row

In [5]:
# ! at the start of a line means: Run the shell command (here, in Unix)

!cat mydata.csv

0,684,559,629,192,835
1,763,707,359,9,723
2,277,754,804,599,70
3,472,600,396,314,705

In [6]:
# let's load our data file into a data frame

df = pd.read_csv('mydata.csv')

In [7]:
df

   0  684  559  629  192  835
0  1  763  707  359    9  723
1  2  277  754  804  599   70
2  3  472  600  396  314  705

In [8]:
# if I want to tell Pandas *not* to read the first line as column names, but
# rather to treat it as data, just pass header=None

df = pd.read_csv('mydata.csv', header=None)
df

   0    1    2    3    4    5
0  0  684  559  629  192  835
1  1  763  707  359    9  723
2  2  277  754  804  599   70
3  3  472  600  396  314  705

In [ ]:
# if you pass header=n, where n is an integer, then Pandas will ignore all lines
# up to line n in the file, then take line n
# as the header names.

# Useful options for `read_csv`

1. `header` -- either an integer, indicating on what line the headers are located, *or* `None`, in which case no headers are in the file.
2. `usecols` -- a list of integers (column indexes) or strings (column names) that you want to include when you read the data
3. `names` -- pass a list of strings, the names that we want to give to the columns that we've read
4. `index_col` -- the name (or numeric index) of a column you want to use for the data frame's index
5. `sep` -- a string, indicating what character(s) separate fields. Note that you cannot say "this or that," but whatever string you give here is taken literally, whether one character or longer.

In [9]:
# Another option: usecols, where we give a list of columns (either strings, if we have their names, or
# integers, referring to them by number starting at 0) that we want in the data frame

In [10]:
pd.read_csv('../data/taxi.csv', 
            usecols=['passenger_count',
                     'trip_distance',
                     'total_amount'])

      passenger_count  trip_distance  total_amount
0                   1           1.63         17.80
1                   1           0.46          8.30
2                   1           0.87         11.00
3                   1           2.13         17.16
4                   1           1.40         10.30
...               ...            ...           ...
9994                1           2.70         12.30
9995                1           4.50         20.30
9996                1           5.59         22.30
9997                6           1.54          7.80
9998                1           5.80         26.75

[9999 rows x 3 columns]

In [12]:
pd.read_csv('mydata.csv',
            usecols=[1,3,4],
           header=None)

     1    3    4
0  684  629  192
1  763  359    9
2  277  804  599
3  472  396  314

In [13]:
# after I load the data frame into memory, I can assign a list of strings (or a series of strings) to df.columns
# and thus set the names

# but I can do that at load time by passing the "names" keyword argument

pd.read_csv('mydata.csv',
            usecols=[1,3,4],
           header=None,
           names=['first', 'third', 'fourth'])

   first  third  fourth
0    684    629     192
1    763    359       9
2    277    804     599
3    472    396     314

In [15]:
# what if, when loading the taxi data, I want the `tpep_pickup_datetime` column to be the index?
# we can always set a column to be the index with set_index. But we can do that as part of reading
# the data by passing the index_col keyword argument, giving it the name (or numeric index) of
# the column we want.

df = pd.read_csv('../data/taxi.csv',
            usecols=['tpep_pickup_datetime',
                     'passenger_count',
                     'total_amount',
                     'trip_distance'],
            index_col='tpep_pickup_datetime')
df

                      passenger_count  trip_distance  total_amount
tpep_pickup_datetime
2015-06-02 11:19:29                 1           1.63         17.80
2015-06-02 11:19:30                 1           0.46          8.30
2015-06-02 11:19:31                 1           0.87         11.00
2015-06-02 11:19:31                 1           2.13         17.16
2015-06-02 11:19:32                 1           1.40         10.30
...                               ...            ...           ...
2015-06-01 00:12:59                 1           2.70         12.30
2015-06-01 00:12:59                 1           4.50         20.30
2015-06-01 00:13:00                 1           5.59         22.30
2015-06-01 00:13:02                 6           1.54          7.80
2015-06-01 00:13:04                 1           5.80         26.75

[9999 rows x 3 columns]

In [16]:
df.loc['2015-06-01 00:13:00']

                      passenger_count  trip_distance  total_amount
tpep_pickup_datetime
2015-06-01 00:13:00                 1           0.30          5.30
2015-06-01 00:13:00                 1           2.50         10.80
2015-06-01 00:13:00                 6           0.86          5.80
2015-06-01 00:13:00                 1           4.91         23.79
2015-06-01 00:13:00                 1          12.56         58.34
2015-06-01 00:13:00                 1           5.59         22.30

In [ ]:
# we can even pass the "dtype" keyword argument, giving it a dictionary as a value, where the keys are
# column names and the values are dtypes we want to give those column names.

In [17]:
!head /etc/passwd

root:x:0:0:root:/root:/bin/bash
daemon:x:1:1:daemon:/usr/sbin:/usr/sbin/nologin
bin:x:2:2:bin:/bin:/usr/sbin/nologin
sys:x:3:3:sys:/dev:/usr/sbin/nologin
sync:x:4:65534:sync:/bin:/bin/sync
games:x:5:60:games:/usr/games:/usr/sbin/nologin
man:x:6:12:man:/var/cache/man:/usr/sbin/nologin
lp:x:7:7:lp:/var/spool/lpd:/usr/sbin/nologin
mail:x:8:8:mail:/var/mail:/usr/sbin/nologin
news:x:9:9:news:/var/spool/news:/usr/sbin/nologin

In [22]:
pd.read_csv('/etc/passwd',
           sep=':',
           header=None,
           names=['username', 'x', 'userid', 'groupid', 'userrealname', 'homedir', 'shell'],
           index_col='username')

,x,userid,groupid,userrealname,homedir,shell
username,,,,,,
root,x,0,0,root,/root,/bin/bash
daemon,x,1,1,daemon,/usr/sbin,/usr/sbin/nologin
bin,x,2,2,bin,/bin,/usr/sbin/nologin
sys,x,3,3,sys,/dev,/usr/sbin/nologin
sync,x,4,65534,sync,/bin,/bin/sync
games,x,5,60,games,/usr/games,/usr/sbin/nologin
man,x,6,12,man,/var/cache/man,/usr/sbin/nologin
lp,x,7,7,lp,/var/spool/lpd,/usr/sbin/nologin
mail,x,8,8,mail,/var/mail,/usr/sbin/nologin
news,x,9,9,news,/var/spool/news,/usr/sbin/nologin
uucp,x,10,10,uucp,/var/spool/uucp,/usr/sbin/nologin
proxy,x,13,13,proxy,/bin,/usr/sbin/nologin
www-data,x,33,33,www-data,/var/www,/usr/sbin/nologin
backup,x,34,34,backup,/var/backups,/usr/sbin/nologin
list,x,38,38,Mailing List Manager,/var/list,/usr/sbin/nologin
irc,x,39,39,ircd,/run/ircd,/usr/sbin/nologin
_apt,x,42,65534,NaN,/nonexistent,/usr/sbin/nologin
nobody,x,65534,65534,nobody,/nonexistent,/usr/sbin/nologin
systemd-network,x,998,998,systemd Network Management,/,/usr/sbin/nologin
systemd-timesync,x,997,997,systemd Time Synchronization,/,/usr/sbin/nologin
dhcpcd,x,100,65534,"DHCP Client Daemon,,,",/usr/lib/dhcpcd,/bin/false
messagebus,x,101,106,NaN,/nonexistent,/usr/sbin/nologin
syslog,x,102,107,NaN,/nonexistent,/usr/sbin/nologin
systemd-resolve,x,996,996,systemd Resolver,/,/usr/sbin/nologin
uuidd,x,103,108,NaN,/run/uuidd,/usr/sbin/nologin
tss,x,104,109,"TPM software stack,,,",/var/lib/tpm,/bin/false
tcpdump,x,105,110,NaN,/nonexistent,/usr/sbin/nologin
sshd,x,106,65534,NaN,/run/sshd,/usr/sbin/nologin
pollinate,x,107,1,NaN,/var/cache/pollinate,/bin/false
landscape,x,108,112,NaN,/var/lib/landscape,/usr/sbin/nologin
fwupd-refresh,x,109,113,"fwupd-refresh user,,,",/run/systemd,/usr/sbin/nologin
polkitd,x,995,995,polkit,/nonexistent,/usr/sbin/nologin
lxd,x,999,100,NaN,/var/snap/lxd/common/lxd,/bin/false
postfix,x,110,118,NaN,/var/spool/postfix,/usr/sbin/nologin
student,x,1000,1000,",,,",/home/student,/bin/bash
do-agent,x,994,994,NaN,/home/do-agent,/bin/false

# Exercise: Airline data

There is a file on our system called `../data/airlines.dat`. Load this data into a data frame using `pd.rea

In [24]:
!head -30 ../data/airlines.dat

1,"Private flight",\N,"-","N/A","","","Y"
2,"135 Airways",\N,"","GNL","GENERAL","United States","N"
3,"1Time Airline",\N,"1T","RNX","NEXTIME","South Africa","Y"
4,"2 Sqn No 1 Elementary Flying Training School",\N,"","WYT","","United Kingdom","N"
5,"213 Flight Unit",\N,"","TFU","","Russia","N"
6,"223 Flight Unit State Airline",\N,"","CHD","CHKALOVSK-AVIA","Russia","N"
7,"224th Flight Unit",\N,"","TTF","CARGO UNIT","Russia","N"
8,"247 Jet Ltd",\N,"","TWF","CLOUD RUNNER","United Kingdom","N"
9,"3D Aviation",\N,"","SEC","SECUREX","United States","N"
10,"40-Mile Air",\N,"Q5","MLA","MILE-AIR","United States","Y"
11,"4D Air",\N,"","QRT","QUARTET","Thailand","N"
12,"611897 Alberta Limited",\N,"","THD","DONUT","Canada","N"
13,"Ansett Australia",\N,"AN","AAA","ANSETT","Australia","Y"
14,"Abacus International",\N,"1B","","","Singapore","Y"
15,"Abelag Aviation",\N,"W9","AAB","ABG","Belgium","N"
16,"Army Air Corps",\N,"","AAC","ARMYAIR","United Kingdom","N"
17,"Aero Aviation Centre Ltd.",\N,"","AAD","SUNRISE","Canada","N"
18,"Aero Servicios Ejecutivos Internacionales",\N,"","SII","ASEISA","Mexico","N"
19,"Aero Biniza",\N,"","BZS","BINIZA","Mexico","N"
20,"Aero Albatros",\N,"","ABM","ALBATROS ESPANA","Spain","N"
21,"Aigle Azur",\N,"ZI","AAF","AIGLE AZUR","France","Y"
22,"Aloha Airlines",\N,"AQ","AAH","ALOHA","United States","Y"
23,"Alaska Island Air",\N,"","AAK","ALASKA ISLAND","United States","N"
24,"American Airlines",\N,"AA","AAL","AMERICAN","United States","Y"
25,"Aviation Management Corporation",\N,"","AAM","AM CORP","United States","N"
26,"Atlantis Airlines (USA)",\N,"","AAO","ATLANTIS AIR","United States","N"
27,"Aerovista Airlines",\N,"","AAP","AEROVISTA GROUP","United Arab Emirates","N"
28,"Asiana Airlines",\N,"OZ","AAR","ASIANA","Republic of Korea","Y"
29,"Askari Aviation",\N,"4K","AAS","AL-AAS","Pakistan","Y"
30,"Australia Asia Airlines",\N,"","AAU","AUSTASIA","Australia","N"